# 1. Базовый образ
# Используем официальный, легковесный образ Python.
FROM python:3.11-slim

# 2. Переменные окружения и рабочая директория
# Устанавливаем рабочую директорию внутри контейнера. Все последующие команды будут выполняться внутри нее.
WORKDIR /app
# Установка системных зависимостей для работы с PostgreSQL (psycopg2)
RUN apt-get update && apt-get install -y \
    gcc \
    python3-dev \
    libpq-dev \
    && rm -rf /var/lib/apt/lists/*
# 3. Копирование зависимостей и установка
# Инструкция COPY: Копируем наш файл зависимостей из локальной папки в /app внутри контейнера.
COPY requirements.txt .

# Устанавливаем зависимости из requirements.txt
RUN pip install --no-cache-dir -r requirements.txt

# 4. Копирование кода приложения
# Копируем весь остальной код из текущей локальной папки (где находится Dockerfile) в /app
COPY . .

# 5. Открытие порта
# Инструкция EXPOSE: Информирует Docker о том, какой порт слушает приложение внутри контейнера (для документации, но не для фактического открытия).
EXPOSE 8000

# 6. Запуск приложения
# Инструкция CMD: Определяет команду, которая будет выполнена при запуске контейнера.
# Запускаем Uvicorn для обслуживания нашего main.py:app
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]